In [27]:
import pandas as pd
import numpy as np

In [18]:
import os
os.chdir('bigdata-analysis-test-study')
# df = pd.read_csv(r"D:\study\bigdata-analysis-test-study\data\Titanic.csv")
df=pd.read_csv("data/Titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 작업형 1 연습 - 문제 1
🎯 문제 1: 조건부 집계 (기본)
문제
승객 클래스(Pclass)별로 그룹을 나누어서, 각 클래스에서 생존한 승객의 평균 나이를 구하세요.
조건:

생존한 승객만 대상 (Survived == 1)
결측치(NaN)가 있는 나이는 제외하고 계산
소수점 둘째 자리까지 반올림
결과를 딕셔너리 형태로 출력: {클래스: 평균나이}

힌트

먼저 생존한 승객만 필터링
나이에 결측치가 없는 데이터만 선택
Pclass로 groupby 후 Age의 평균 계산

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [35]:
group=df.groupby("Pclass")

In [41]:
result = df[(df['Survived'] == 1) & (df['Age'].notna())].groupby('Pclass')['Age'].mean().round(2).to_dict()
print(result)

{1: 35.37, 2: 25.9, 3: 20.65}

In [55]:
# 1단계: 생존한 승객만 필터링
survived_passengers = df[df['Survived'] == 1]
print("생존자 수:", len(survived_passengers))

생존자 수: 342

In [57]:
# 2단계: 나이 결측치 제거
survived_with_age = survived_passengers[survived_passengers['Age'].notna()]
print("나이 정보가 있는 생존자 수:", len(survived_with_age))

나이 정보가 있는 생존자 수: 290

In [61]:
survived_with_age['Age'].mean()

28.343689655172415

In [59]:
# 3단계: 클래스별 그룹화 후 나이 평균 계산
class_age_mean = survived_with_age.groupby('Pclass')['Age'].mean()
print("클래스별 평균 나이:")
print(class_age_mean)

클래스별 평균 나이:
Pclass
1    35.368197
2    25.901566
3    20.646118
Name: Age, dtype: float64

In [63]:

# 문제 1 정답
result = df[(df['Survived'] == 1) & (df['Age'].notna())].groupby('Pclass')['Age'].mean().round(2).to_dict()
print(result)

{1: 35.37, 2: 25.9, 3: 20.65}

## 작업형 1 연습 - 문제 2
🎯 문제 2: 결측치 처리 + 조건부 집계
문제
나이(Age) 컬럼의 결측치를 성별(Gender)별 중앙값으로 채운 후, 각 성별에서 요금(Fare)이 가장 비싼 승객의 나이를 구하세요.
조건:

나이 결측치를 성별별 중앙값으로 대체
성별별로 요금이 최대인 승객 찾기
해당 승객들의 나이를 정수로 반환
결과를 딕셔너리 형태로 출력: {'female': 나이, 'male': 나이}

힌트

성별별 나이 중앙값 계산
결측치 대체
성별별 요금 최대값 찾기
최대 요금 승객의 나이 추출

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [68]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## 나이 결측치를 성별별 중앙값으로 대체

In [106]:
# df['Gender'].isnull().sum()
m_med=df[df['Gender']=='male']['Age'].median()
f_med=df[df['Gender']=='female']['Age'].median()
df[df['Gender']=='male']['Age'].fillna(m_med, inplace=True)

C:\Users\pjjeo\AppData\Local\Temp\ipykernel_70760\3103380174.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['Gender']=='male']['Age']= df[df['Gender']=='male']['Age'].fillna(m_med)

In [108]:
df[df['Gender']=='male']['Age'].isnull().sum()

124

In [114]:
# 방법 1: loc 사용 (가장 안전)
df.loc[df['Gender']=='male', 'Age'] = df.loc[df['Gender']=='male', 'Age'].fillna(m_med)
df.loc[df['Gender']=='female', 'Age'] = df.loc[df['Gender']=='female', 'Age'].fillna(f_med)

### 성별별로 요금이 최대인 승객 찾기

In [141]:
m_max_fare=df.loc[df['Gender']=='male','Fare'].max()

In [143]:
f_max_fare=df.loc[df['Gender']=='female','Fare'].max()

In [145]:
df.loc[(df['Gender']=='male') & (df['Fare']==m_max_fare), 'Age']

679    36.0
737    35.0
Name: Age, dtype: float64

In [147]:
df.loc[(df['Gender']=='female')&(df['Fare']==f_max_fare),'Age']

258    35.0
Name: Age, dtype: float64

In [137]:
max_idx = df.loc[df['Gender']=='male','Fare'].idxmax()
age = df.loc[max_idx, 'Age']

In [139]:
print(age)

36.0

## 작업형 1 연습 - 문제 3
🎯 문제 3: 정렬 + 상위 데이터 추출
문제
승객을 나이 내림차순으로 정렬한 후, 상위 20명의 평균 요금과 하위 20명의 평균 요금의 차이를 구하세요.
조건:

나이에 결측치가 있는 승객은 제외
나이 내림차순 정렬 (나이 많은 순)
상위 20명(나이 많은 20명)의 평균 요금 계산
하위 20명(나이 적은 20명)의 평균 요금 계산
상위 평균 - 하위 평균의 차이를 소수점 둘째 자리까지 반올림

In [163]:
df2=df.copy()

In [171]:
df2['Age'].isnull().sum()

0

In [185]:
df2_sorted=df2.sort_values('Age', ascending=False)
df2_sorted.loc[0:20,'Fare'].mean()

nan

In [207]:
df2_sorted.iloc[0:20, 9].mean()

43.58042

In [197]:
df2_sorted.loc[0:20, 'Fare'].mean()

nan

In [217]:
print(round(df2_sorted.head(20)['Fare'].mean()-df2_sorted.tail(20)['Fare'].mean(),1))

6.0

In [215]:

# 문제 3 완료된 코드
result = df2_sorted.head(20)['Fare'].mean() - df2_sorted.tail(20)['Fare'].mean()
print(f"상위 20명과 하위 20명의 요금 차이: {result}")

# 문제에서 요구한 소수점 둘째 자리 반올림
final_answer = round(result, 2)
print(f"최종 답안 (소수점 둘째 자리): {final_answer}")

# === 검증 ===
print("\n=== 검증 ===")
top_20 = df2_sorted.head(20)
bottom_20 = df2_sorted.tail(20)

print(f"상위 20명 나이 범위: {top_20['Age'].min():.1f} ~ {top_20['Age'].max():.1f}세")
print(f"하위 20명 나이 범위: {bottom_20['Age'].min():.1f} ~ {bottom_20['Age'].max():.1f}세")

print(f"상위 20명 평균 요금: {top_20['Fare'].mean():.2f}")
print(f"하위 20명 평균 요금: {bottom_20['Fare'].mean():.2f}")
print(f"차이: {final_answer}")

# 🎯 코드 분석
print("\n=== 코드 분석 ===")
print("✅ 정렬: sort_values('Age', ascending=False)")
print("✅ 상위 추출: head(20)")  
print("✅ 하위 추출: tail(20)")
print("✅ 평균 계산: mean()")
print("✅ 차이 계산: 상위 - 하위")
print("✅ 한 줄 완성: 매우 효율적!")

상위 20명과 하위 20명의 요금 차이: 6.034169999999996
최종 답안 (소수점 둘째 자리): 6.03

=== 검증 ===
상위 20명 나이 범위: 61.0 ~ 80.0세
하위 20명 나이 범위: 0.4 ~ 2.0세
상위 20명 평균 요금: 43.58
하위 20명 평균 요금: 37.55
차이: 6.03

=== 코드 분석 ===
✅ 정렬: sort_values('Age', ascending=False)
✅ 상위 추출: head(20)
✅ 하위 추출: tail(20)
✅ 평균 계산: mean()
✅ 차이 계산: 상위 - 하위
✅ 한 줄 완성: 매우 효율적!

## 작업형 1 연습 - 문제 4
🎯 문제 4: 그룹별 결측치 대체 (기출 스타일)
- 나이(Age) 컬럼의 결측치를 승객 클래스(Pclass)와 성별(Gender)이 같은 그룹의 평균 나이로 대체한 후, 각 클래스별 평균 나이의 차이를 구하세요.
    - 나이 결측치를 Pclass + Gender 조합별 평균으로 대체
    - 1등석과 3등석의 평균 나이 차이를 계산
    - 소수점 첫째 자리까지 반올림

In [325]:
df=pd.read_csv("data/Titanic.csv")

### 답안 축약

In [374]:
#축약 식 답
df['Age']=df['Age'].fillna(df.groupby(['Pclass','Gender'])['Age'].transform('mean'))
abs(round(df[df['Pclass']==3]['Age'].mean()-df[df['Pclass']==1]['Age'].mean(),1))

13.3


- df.groupby(['Pclass', 'Gender'])['Age'].transform('mean')은 각 (Pclass, Gender) 그룹의 평균 나이로 해당 그룹의 모든 행의 'Age' 값을 대체한 Series를 반환해.
- 원래의 인덱스와 길이를 유지하면서 그룹 평균을 각 행에 할당하지.
- 그럼 그걸 전체 인덱스에 fillna 에 사용할 수 있어.
- groupby(...).transform('mean') → 그룹 평균을 전체 인덱스 기준으로 확장
- fillna(...) → 그 그룹 평균으로 결측치만 채움
- groupby + transform + fillna는 세트처럼 외워도 돼.

In [372]:
df=pd.read_csv("data/Titanic.csv")

In [327]:
df1=df.copy()
df2=df.copy()

### 1번 방법. transform 으로 결측치를 그룹별로 채우기

In [329]:
df1['Age'].isnull().sum()

177

In [331]:
group=df1.groupby(['Pclass','Gender'])

In [333]:
grouped_mean=group['Age'].transform('mean')

In [335]:
df1['Age']=df1['Age'].fillna(grouped_mean)

In [337]:
df1['Age'].isnull().sum()

0

### 1등석과 3등석의 평균 나이 차이를 계산 소수점 첫째 자리까지 반올림

In [357]:
abs(round(df1[df1['Pclass']==3]['Age'].mean()-df1[df1['Pclass']==1]['Age'].mean(),1))

13.3

### 2번 방법: 직접 할당. 어려움

In [343]:
df2.groupby(['Pclass','Gender'])['Age'].mean()

Pclass  Gender
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [347]:
df2[(df2['Pclass']==1)&(df2['Gender']=='female')]['Age'].fillna(34.611765)

1      38.000000
3      35.000000
11     58.000000
31     34.611765
52     49.000000
         ...
856    45.000000
862    48.000000
871    47.000000
879    56.000000
887    19.000000
Name: Age, Length: 94, dtype: float64

In [264]:
df_copy=df.copy()
# === 방법 1: transform() 사용 (가장 깔끔) ===
print("\n=== 방법 1: transform() 사용 ===")
df_copy['Age'] = df_copy['Age'].fillna(
    df_copy.groupby(['Pclass', 'Gender'])['Age'].transform('mean')
)
print(f"대체 후 결측치 수: {df_copy['Age'].isnull().sum()}")

# === 방법 2: 그룹별 평균 미리 계산 ===
print("\n=== 방법 2: 그룹별 평균 미리 계산 ===")

=== 방법 1: transform() 사용 ===
대체 후 결측치 수: 0

=== 방법 2: 그룹별 평균 미리 계산 ===

In [260]:
df_copy['Age'] = df_copy['Age'].fillna(
    df_copy.groupby(['Pclass', 'Gender'])['Age'].transform('mean')
)

In [269]:
group['Age'].mean()

Pclass  Gender
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [285]:
group_mean=df.groupby(['Pclass', 'Gender'])['Age'].transform('mean')

In [281]:
df.groupby(['Pclass','Gender'])['Age'].mean()

Pclass  Gender
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [289]:
df['Age'] = df['Age'].fillna(group_mean)

### 작업형 1 연습 - 문제 5
- 문제 5: 시계열 데이터 처리
- 승객 ID(PassengerId)를 날짜 형태로 변환하여, 홀수 달에 해당하는 승객들의 평균 요금을 구하세요.

    - PassengerId를 문자열로 변환 후 날짜 형식으로 변환: 2023-01-{PassengerId}
    - 월(month) 추출하여 홀수 달 필터링 (1,3,5,7,9,11월)
    - 홀수 달 승객들의 평균 요금 계산
    - 소수점 둘째 자리까지 반올림

힌트

pd.to_datetime() 사용
.dt.month 로 월 추출
% 2 == 1 로 홀수 판별

In [379]:
df=pd.read_csv("data/Titanic.csv")

In [381]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [385]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S